
`
Important note!!!

This is the total verses as a data bank for the following function!

Due to some unintentional issues during fetching process, I faild to make 

the mentioned verses a separate file. So, the verses are declered here and I am sorry!
`

poem =`به لاله نرگس مخمور گفت وقت سحر

که هر که در صفِ باغ است صاحب هنریست

بنفشه مژدهٔ نوروز میدهد ما را

شکوفه را ز خزان و ز مهرگان خبریست

بجز رُخ تو که زیب و فرش ز خونِ دل است

بهر رخی که درین منظر است زیب و فَریست

جواب داد که من نیز صاحبِ هنرم

درین صحیفه ز من نیز نقشی و اثریست

میان آتشم و هیچگه نمی‌سوزم

هَماره بر سرم از جور آسمان شرریست

علامت خطر است این قَبای خون آلود

هر آنکه در ره هستی است در ره خطریست

بریخت خونِ من و نوبتِ تو نیز رسد

بِدستِ رهزن گیتی هَماره نیشتریست

خوش است اگر گلِ امروز خوش بود فردا

ولی میانِ ز شب تا سحر گهان اگریست

از آن، زمانه به ما ایستادگی آموخت

که تا ز پای نیفتیم، تا که پا و سریست

یکی نظر به گل افکند و دیگری بگیاه

ز خوب و زشت چه منظور؟ هر که را نظریست

نه هر نسیم که اینجاست بر تو می‌گذرد

صبا صباست، به هر سبزه و گلش گذریست

میان لاله و نرگس چه فرق، هر دو خوشند

که گل بِطرف چمن هر چه هست عشوه‌گریست

تو غرق سیم و زر و من ز خون دل رنگین

بفقر خلق چه خندی، تو را که سیم و زریست

ز آب چشمه و باران نمی‌شود خاموش

که آتشی که در اینجاست آتش جگریست

هنر نمای نبودم بدین هنرمندی

سخن حدیث دگر، کار قصهٔ دگریست

گل از بساط چمن تنگدل نخواهد رفت

بدان دلیل که مهمانِ شامی و سحریست

تو روی سَخت قضا و قدر ندیدستی

هنوز آنچه تو را می‌نماید آستریست

از آن، دراز نکردم سخن درین معنی

که کار زندگی لاله کار مختصریست

خوش آنکه نام نکوئی بیادگار گذاشت

که عمر بی ثمر نیک، عمر بی ثمریست

کسیکه در طلب نام نیک رنج کشید

اگرچه نام و نشانیش نیست، ناموریست

ای خوشا مستانه سر در پای دلبر داشتن

دل تهی از خوب و زشت چرخ اخضر داشتن

نزد شاهین محبت بی پر و بال آمدن

پیش باز عشق آئین کبوتر داشتن

سوختن بگداختن چون شمع و بزم افروختن

تن بیاد روی جانان اندر آذر داشتن

اشک را چون لعل پروردن بخوناب جگر

دیده را سوداگر یاقوت احمر داشتن

هر کجا نور است چون پروانه خود را باختن

هر کجا نار است خود را چون سمندر داشتن

آب حیوان یافتن بیرنج در ظلمات دل

زان همی نوشیدن و یاد سکندر داشتن

از برای سود، در دریای بی پایان علم

عقل را مانند غواصان، شناور داشتن

گوشوار حکمت اندر گوش جان آویختن

چشم دل را با چراغ جان منور داشتن

در گلستان هنر چون نخل بودن بارور

عار از ناچیزی سرو و صنوبر داشتن

از مس دل ساختن با دست دانش زر ناب

علم و جان را کیمیا و کیمیاگر داشتن

همچو مور اندر ره همت همی پا کوفتن

چون مگس همواره دست شوق بر سر داشتن
`



export function poetry(verse) {
splited = poem.split("\n");


for (let key in splited) {
  if (splited[key] === "") {
    delete splited[key];
  }
}

let data = new Object();

for (let i = 0; i < splited.length; i = i + 4) {
  data[i] = splited[i] + splited[Number(i) + 2];
}

poemData1 = [];

for (item in data) {
  let key1 = data[item].charAt(0);
  poemData1.push({ [key1]: data[item] });
}

let splitedVerse = verse.trim().split(" ");

let lastWordOfVerse = splitedVerse.at(-1);

for (item of poemData1) {
  if (lastWordOfVerse.at(-1) === Object.keys(item)[0]) {

    return(Object.values(item)[0]);
    // console.log(Object.values(item)[0])
    break;
  }

}

}

verse = `       بنفشه مژدهٔ نوروز میدهد ما را

شکوفه را ز خزان و ز مهرگان خبریست     `;

console.log(poetry(verse))